## staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                             |
|----------|--------------------------------------------------------------|
| update   | `aws_acm_certificate.internal_dns`                           |
| recreate | `aws_route53_zone.internal_dns`                              |
|          | `aws_secretsmanager_secret_version.internal_dns_cert_base64` |
|          | `aws_secretsmanager_secret_version.internal_dns_fqdn`        |
|          | `tls_self_signed_cert.internal_dns`                          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
16:00:50.205 STDOUT terraform:   ~ update in-place
16:00:50.205 STDOUT terraform: -/+ destroy and then create replacement
16:00:50.205 STDOUT terraform: +/- create replacement and then destroy
16:00:50.205 STDOUT terraform: Terraform will perform the following actions:
16:00:50.205 STDOUT terraform:   # aws_acm_certificate.internal_dns will be updated in-place
16:00:50.205 STDOUT terraform:   ~ resource "aws_acm_certificate" "internal_dns" {
16:00:50.205 STDOUT terraform:       ~ certificate_body          = <<-EOT
16:00:50.205 STDOUT terraform:             -----BEGIN CERTIFICATE-----
16:00:50.205 STDOUT terraform:             MIIDGDCCAgCgAwIBAgIRAKiDvLoYTr+l/mRv6RMlPsQwDQYJKoZIhvcNAQELBQAw
16:00:50.205 STDOUT terraform:             LDEqMCgGA1UEAxMhc3RhZ2luZy5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29tMB4X
16:00:50.205 STDOUT terraform:             DTI0MDIxMjE5NTgwMFoXDTI5MDIxMDE5NTgwMFowLDEqMCgGA1UEAxMhc3RhZ2lu
16:00:50.205 STDOUT terraform:             Zy5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOC
16:00:50.206 STDOUT terraform:             AQ8AMIIBCgKCAQEAu/UeI7sfHHz4gsOvkRr5KSeN1z6s3jlkcKyWUYoNFuffrSYh
16:00:50.206 STDOUT terraform:             AmyagZKz3bP5etJ2jdfRmihiQfLwxHcmtTlOsjaNpOLQLsZ4WGnB862P8/FKyL2m
16:00:50.206 STDOUT terraform:             CMkQ5G8Hdm2kP2q6WuJfK7+m9VsZxxZp/vKcpWHYkKeRRFrg7/SNQxmO6UGaWs1E
16:00:50.206 STDOUT terraform:             6uztthLrVSvFXTvKes5Dwocgg8vBc4MvTZ7S651tnWxuzr8rqghCHjCuzkOrG83R
16:00:50.206 STDOUT terraform:             jTIvUsYsao7Z3cvlYzrfbfZRa3I/28XS316W+J2fG6VfsvXZQVsUdk9ytEM9sWhP
16:00:50.206 STDOUT terraform:             sYugnJunpMr9aZltI7ufNKiZnP03yEn0pO0uJQIDAQABozUwMzAOBgNVHQ8BAf8E
16:00:50.206 STDOUT terraform:             BAMCBaAwEwYDVR0lBAwwCgYIKwYBBQUHAwEwDAYDVR0TAQH/BAIwADANBgkqhkiG
16:00:50.206 STDOUT terraform:             9w0BAQsFAAOCAQEAYw1bUADQ6Rpl1e9doA/qTPIOlD4cMWHXMgQAvwf9nJddAlys
16:00:50.206 STDOUT terraform:             7I5+D8+xz+7Q8ExwEMpolwbfNA80UxpLC03JnKc4ZpiI9AGSnV+VvmSqGtDd1Thq
16:00:50.206 STDOUT terraform:             WcvkEWpFXm8ODzXnvtFr+Hr1qfY090HxMGRYRcc6H5xzoFSiJzRJfynxzAk+66xO
16:00:50.206 STDOUT terraform:             1/1uFwISYTIf9a7IicfoJCfOD+jkgvay/KU7ghJhT1494sSa1WWpevTDutjtCI+o
16:00:50.206 STDOUT terraform:             Heydee9Dcva0j4IzgTGRBtIVLAQQK3VqFZQvrJHPEDMHJ/s5KyKGd2Y67t0jBiIr
16:00:50.206 STDOUT terraform:             7sipVq4553KsQVgnmWMbemL6K0fDrHUtk5tJFQ==
16:00:50.206 STDOUT terraform:             -----END CERTIFICATE-----
16:00:50.206 STDOUT terraform:         EOT -> (known after apply)
16:00:50.206 STDOUT terraform:         id                        = "arn:aws:acm:ca-central-1:239043911459:certificate/ee889f75-237c-4d72-9833-61a0296b2db8"
16:00:50.206 STDOUT terraform:         tags                      = {
16:00:50.206 STDOUT terraform:             "CostCenter" = "notification-canada-ca-staging"
16:00:50.206 STDOUT terraform:             "Name"       = "notification-canada-ca"
16:00:50.206 STDOUT terraform:         }
16:00:50.206 STDOUT terraform:         # (19 unchanged attributes hidden)
16:00:50.207 STDOUT terraform:         # (1 unchanged block hidden)
16:00:50.207 STDOUT terraform:     }
16:00:50.207 STDOUT terraform:   # aws_route53_zone.internal_dns must be replaced
16:00:50.207 STDOUT terraform: +/- resource "aws_route53_zone" "internal_dns" {
16:00:50.207 STDOUT terraform:       ~ arn                 = "arn:aws:route53:::hostedzone/Z05954862D4D5HXU20M59" -> (known after apply)
16:00:50.207 STDOUT terraform:       ~ id                  = "Z05954862D4D5HXU20M59" -> (known after apply)
16:00:50.207 STDOUT terraform:       ~ name                = "staging.notification.internal.com" -> "notification.prv" # forces replacement
16:00:50.207 STDOUT terraform:       ~ name_servers        = [
16:00:50.207 STDOUT terraform:           - "ns-0.awsdns-00.com.",
16:00:50.207 STDOUT terraform:           - "ns-1024.awsdns-00.org.",
16:00:50.207 STDOUT terraform:           - "ns-1536.awsdns-00.co.uk.",
16:00:50.207 STDOUT terraform:           - "ns-512.awsdns-00.net.",
16:00:50.207 STDOUT terraform:         ] -> (known after apply)
16:00:50.207 STDOUT terraform:       ~ primary_name_server = "ns-0.awsdns-00.com." -> (known after apply)
16:00:50.207 STDOUT terraform:       - tags                = {} -> null
16:00:50.207 STDOUT terraform:       ~ tags_all            = {} -> (known after apply)
16:00:50.207 STDOUT terraform:       ~ zone_id             = "Z05954862D4D5HXU20M59" -> (known after apply)
16:00:50.207 STDOUT terraform:         # (3 unchanged attributes hidden)
16:00:50.207 STDOUT terraform:       - vpc {
16:00:50.207 STDOUT terraform:           - vpc_id     = "vpc-097508d1f5e243195" -> null
16:00:50.207 STDOUT terraform:           - vpc_region = "ca-central-1" -> null
16:00:50.207 STDOUT terraform:         }
16:00:50.207 STDOUT terraform:       + vpc {
16:00:50.207 STDOUT terraform:           + vpc_id     = "vpc-097508d1f5e243195"
16:00:50.207 STDOUT terraform:           + vpc_region = (known after apply)
16:00:50.207 STDOUT terraform:         }
16:00:50.207 STDOUT terraform:     }
16:00:50.207 STDOUT terraform:   # aws_secretsmanager_secret_version.internal_dns_cert_base64 must be replaced
16:00:50.207 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "internal_dns_cert_base64" {
16:00:50.207 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_CERT_BASE64-NZPM7t" -> (known after apply)
16:00:50.207 STDOUT terraform:       + has_secret_string_wo = (known after apply)
16:00:50.207 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_CERT_BASE64-NZPM7t|terraform-20240212195800927900000004" -> (known after apply)
16:00:50.208 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
16:00:50.208 STDOUT terraform:       ~ version_id           = "terraform-20240212195800927900000004" -> (known after apply)
16:00:50.208 STDOUT terraform:       ~ version_stages       = [
16:00:50.208 STDOUT terraform:           - "AWSCURRENT",
16:00:50.208 STDOUT terraform:         ] -> (known after apply)
16:00:50.208 STDOUT terraform:         # (4 unchanged attributes hidden)
16:00:50.208 STDOUT terraform:     }
16:00:50.208 STDOUT terraform:   # aws_secretsmanager_secret_version.internal_dns_fqdn must be replaced
16:00:50.208 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "internal_dns_fqdn" {
16:00:50.208 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_FQDN-pUqTjc" -> (known after apply)
16:00:50.208 STDOUT terraform:       + has_secret_string_wo = (known after apply)
16:00:50.208 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:INTERNAL_DNS_FQDN-pUqTjc|terraform-20240212195800910200000003" -> (known after apply)
16:00:50.208 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
16:00:50.208 STDOUT terraform:       ~ version_id           = "terraform-20240212195800910200000003" -> (known after apply)
16:00:50.208 STDOUT terraform:       ~ version_stages       = [
16:00:50.208 STDOUT terraform:           - "AWSCURRENT",
16:00:50.208 STDOUT terraform:         ] -> (known after apply)
16:00:50.208 STDOUT terraform:         # (4 unchanged attributes hidden)
16:00:50.208 STDOUT terraform:     }
16:00:50.208 STDOUT terraform:   # tls_self_signed_cert.internal_dns must be replaced
16:00:50.208 STDOUT terraform: +/- resource "tls_self_signed_cert" "internal_dns" {
16:00:50.208 STDOUT terraform:       ~ cert_pem              = <<-EOT
16:00:50.208 STDOUT terraform:             -----BEGIN CERTIFICATE-----
16:00:50.208 STDOUT terraform:             MIIDGDCCAgCgAwIBAgIRAKiDvLoYTr+l/mRv6RMlPsQwDQYJKoZIhvcNAQELBQAw
16:00:50.208 STDOUT terraform:             LDEqMCgGA1UEAxMhc3RhZ2luZy5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29tMB4X
16:00:50.208 STDOUT terraform:             DTI0MDIxMjE5NTgwMFoXDTI5MDIxMDE5NTgwMFowLDEqMCgGA1UEAxMhc3RhZ2lu
16:00:50.209 STDOUT terraform:             Zy5ub3RpZmljYXRpb24uaW50ZXJuYWwuY29tMIIBIjANBgkqhkiG9w0BAQEFAAOC
16:00:50.209 STDOUT terraform:             AQ8AMIIBCgKCAQEAu/UeI7sfHHz4gsOvkRr5KSeN1z6s3jlkcKyWUYoNFuffrSYh
16:00:50.209 STDOUT terraform:             AmyagZKz3bP5etJ2jdfRmihiQfLwxHcmtTlOsjaNpOLQLsZ4WGnB862P8/FKyL2m
16:00:50.209 STDOUT terraform:             CMkQ5G8Hdm2kP2q6WuJfK7+m9VsZxxZp/vKcpWHYkKeRRFrg7/SNQxmO6UGaWs1E
16:00:50.209 STDOUT terraform:             6uztthLrVSvFXTvKes5Dwocgg8vBc4MvTZ7S651tnWxuzr8rqghCHjCuzkOrG83R
16:00:50.209 STDOUT terraform:             jTIvUsYsao7Z3cvlYzrfbfZRa3I/28XS316W+J2fG6VfsvXZQVsUdk9ytEM9sWhP
16:00:50.209 STDOUT terraform:             sYugnJunpMr9aZltI7ufNKiZnP03yEn0pO0uJQIDAQABozUwMzAOBgNVHQ8BAf8E
16:00:50.209 STDOUT terraform:             BAMCBaAwEwYDVR0lBAwwCgYIKwYBBQUHAwEwDAYDVR0TAQH/BAIwADANBgkqhkiG
16:00:50.209 STDOUT terraform:             9w0BAQsFAAOCAQEAYw1bUADQ6Rpl1e9doA/qTPIOlD4cMWHXMgQAvwf9nJddAlys
16:00:50.209 STDOUT terraform:             7I5+D8+xz+7Q8ExwEMpolwbfNA80UxpLC03JnKc4ZpiI9AGSnV+VvmSqGtDd1Thq
16:00:50.209 STDOUT terraform:             WcvkEWpFXm8ODzXnvtFr+Hr1qfY090HxMGRYRcc6H5xzoFSiJzRJfynxzAk+66xO
16:00:50.209 STDOUT terraform:             1/1uFwISYTIf9a7IicfoJCfOD+jkgvay/KU7ghJhT1494sSa1WWpevTDutjtCI+o
16:00:50.209 STDOUT terraform:             Heydee9Dcva0j4IzgTGRBtIVLAQQK3VqFZQvrJHPEDMHJ/s5KyKGd2Y67t0jBiIr
16:00:50.209 STDOUT terraform:             7sipVq4553KsQVgnmWMbemL6K0fDrHUtk5tJFQ==
16:00:50.209 STDOUT terraform:             -----END CERTIFICATE-----
16:00:50.209 STDOUT terraform:         EOT -> (known after apply)
16:00:50.209 STDOUT terraform:       ~ id                    = "223994322017300484718067698048119946948" -> (known after apply)
16:00:50.209 STDOUT terraform:       ~ key_algorithm         = "RSA" -> (known after apply)
16:00:50.209 STDOUT terraform:       ~ validity_end_time     = "2029-02-10T19:58:00.918733473Z" -> (known after apply)
16:00:50.209 STDOUT terraform:       ~ validity_start_time   = "2024-02-12T19:58:00.918733473Z" -> (known after apply)
16:00:50.209 STDOUT terraform:         # (8 unchanged attributes hidden)
16:00:50.209 STDOUT terraform:       ~ subject { # forces replacement
16:00:50.209 STDOUT terraform:           ~ common_name = "staging.notification.internal.com" -> "notification.prv" # forces replacement
16:00:50.210 STDOUT terraform:         }
16:00:50.210 STDOUT terraform:     }
16:00:50.210 STDOUT terraform: Plan: 4 to add, 1 to change, 4 to destroy.
16:00:50.210 STDOUT terraform: Changes to Outputs:
16:00:50.210 STDOUT terraform:   ~ internal_dns_name                     = "staging.notification.internal.com" -> "notification.prv"
16:00:50.210 STDOUT terraform:   ~ internal_dns_zone_id                  = "Z05954862D4D5HXU20M59" -> (known after apply)
16:00:50.210 STDOUT terraform:   ~ notification_internal_dns_cert        = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURHRENDQWdDZ0F3SUJBZ0lSQUtpRHZMb1lUcitsL21SdjZSTWxQc1F3RFFZSktvWklodmNOQVFFTEJRQXcKTERFcU1DZ0dBMVVFQXhNaGMzUmhaMmx1Wnk1dWIzUnBabWxqWVhScGIyNHVhVzUwWlhKdVlXd3VZMjl0TUI0WApEVEkwTURJeE1qRTVOVGd3TUZvWERUSTVNREl4TURFNU5UZ3dNRm93TERFcU1DZ0dBMVVFQXhNaGMzUmhaMmx1Clp5NXViM1JwWm1sallYUnBiMjR1YVc1MFpYSnVZV3d1WTI5dE1JSUJJakFOQmdrcWhraUc5dzBCQVFFRkFBT0MKQVE4QU1JSUJDZ0tDQVFFQXUvVWVJN3NmSEh6NGdzT3ZrUnI1S1NlTjF6NnMzamxrY0t5V1VZb05GdWZmclNZaApBbXlhZ1pLejNiUDVldEoyamRmUm1paGlRZkx3eEhjbXRUbE9zamFOcE9MUUxzWjRXR25CODYyUDgvRkt5TDJtCkNNa1E1RzhIZG0ya1AycTZXdUpmSzcrbTlWc1p4eFpwL3ZLY3BXSFlrS2VSUkZyZzcvU05ReG1PNlVHYVdzMUUKNnV6dHRoTHJWU3ZGWFR2S2VzNUR3b2NnZzh2QmM0TXZUWjdTNjUxdG5XeHV6cjhycWdoQ0hqQ3V6a09yRzgzUgpqVEl2VXNZc2FvN1ozY3ZsWXpyZmJmWlJhM0kvMjhYUzMxNlcrSjJmRzZWZnN2WFpRVnNVZGs5eXRFTTlzV2hQCnNZdWduSnVucE1yOWFabHRJN3VmTktpWm5QMDN5RW4wcE8wdUpRSURBUUFCb3pVd016QU9CZ05WSFE4QkFmOEUKQkFNQ0JhQXdFd1lEVlIwbEJBd3dDZ1lJS3dZQkJRVUhBd0V3REFZRFZSMFRBUUgvQkFJd0FEQU5CZ2txaGtpRwo5dzBCQVFzRkFBT0NBUUVBWXcxYlVBRFE2UnBsMWU5ZG9BL3FUUElPbEQ0Y01XSFhNZ1FBdndmOW5KZGRBbHlzCjdJNStEOCt4eis3UThFeHdFTXBvbHdiZk5BODBVeHBMQzAzSm5LYzRacGlJOUFHU25WK1Z2bVNxR3REZDFUaHEKV2N2a0VXcEZYbThPRHpYbnZ0RnIrSHIxcWZZMDkwSHhNR1JZUmNjNkg1eHpvRlNpSnpSSmZ5bnh6QWsrNjZ4TwoxLzF1RndJU1lUSWY5YTdJaWNmb0pDZk9EK2prZ3ZheS9LVTdnaEpoVDE0OTRzU2ExV1dwZXZURHV0anRDSStvCkhleWRlZTlEY3ZhMGo0SXpnVEdSQnRJVkxBUVFLM1ZxRlpRdnJKSFBFRE1ISi9zNUt5S0dkMlk2N3QwakJpSXIKN3NpcFZxNDU1M0tzUVZnbm1XTWJlbUw2SzBmRHJIVXRrNXRKRlE9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==" -> (known after apply)
16:00:50.210 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
16:00:50.210 STDOUT terraform: Saved the plan to: plan.tfplan
16:00:50.210 STDOUT terraform: To perform exactly these actions, run the following command to apply:
16:00:50.210 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"custom-sending-domain.staging.notification.cdssandbox.xyz\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

33 tests, 19 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
